In [1]:
data2 = [['s1', 25, 95.],
         ['s2', 28, 80.],
         ['s3', 22, 75.]]
data2

[['s1', 25, 95.0], ['s2', 28, 80.0], ['s3', 22, 75.0]]

In [3]:
import pandas as pd
df2 = pd.DataFrame(data2)
df2

    0   1     2
0  s1  25  95.0
1  s2  28  80.0
2  s3  22  75.0

In [5]:
df3 = pd.DataFrame(data2, index = ['1행', '2행', '3행'],
                   columns = ['Name', 'Age', 'Score'])
df3

   Name  Age  Score
1행   s1   25   95.0
2행   s2   28   80.0
3행   s3   22   75.0

In [7]:
df3['Name']

1행    s1
2행    s2
3행    s3
Name: Name, dtype: object

In [9]:
df3['Age']

1행    25
2행    28
3행    22
Name: Age, dtype: int64

In [11]:
df3[['Name', 'Score']]

   Name  Score
1행   s1   95.0
2행   s2   80.0
3행   s3   75.0

In [13]:
df3.loc['1행']

Name     s1
Age      25
Score    95
Name: 1행, dtype: object

In [15]:
df3.loc[['1행', '3행']]

   Name  Age  Score
1행   s1   25   95.0
3행   s3   22   75.0

In [17]:
df3.loc['1행', 'Name']

's1'

In [19]:
df3.loc[:, 'Name']

1행    s1
2행    s2
3행    s3
Name: Name, dtype: object

In [21]:
df3.loc[:, ['Name', 'Score']]

   Name  Score
1행   s1   95.0
2행   s2   80.0
3행   s3   75.0

In [23]:
df3.loc[:, 'Name':'Score']

   Name  Age  Score
1행   s1   25   95.0
2행   s2   28   80.0
3행   s3   22   75.0

In [25]:
df3.iloc[0, 0]

's1'

In [27]:
df3.iloc[:, :]

   Name  Age  Score
1행   s1   25   95.0
2행   s2   28   80.0
3행   s3   22   75.0

In [29]:
df3.iloc[:, [0, 2]]

   Name  Score
1행   s1   95.0
2행   s2   80.0
3행   s3   75.0

In [31]:
df3.iloc[::2, [0, 2]]

   Name  Score
1행   s1   95.0
3행   s3   75.0

In [34]:
#head and tail
df3.head(1)
df3.tail(2)
df = df3.copy()
#dataframe summary

In [36]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1행 to 3행
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Score   3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 176.0+ bytes

In [38]:
df3.describe()

        Age      Score
count   3.0   3.000000
mean   25.0  83.333333
std     3.0  10.408330
min    22.0  75.000000
25%    23.5  77.500000
50%    25.0  80.000000
75%    26.5  87.500000
max    28.0  95.000000

In [40]:
df3.nunique()

Name     3
Age      3
Score    3
dtype: int64

In [42]:
df3['Score'].value_counts()

75.0    1
80.0    1
95.0    1
Name: Score, dtype: int64

In [44]:
df3['Score'].count()

3

In [46]:
df3['Score'].sum()

250.0

In [49]:
df3['Score'].std()

10.408329997330664

In [51]:
df4 = df3.copy()
df4

   Name  Age  Score
1행   s1   25   95.0
2행   s2   28   80.0
3행   s3   22   75.0

In [53]:
df4 = df4.iloc[:, [0, 2, 1]]
df4

   Name  Age  Score
1행   s1   25   95.0
2행   s2   28   80.0
3행   s3   22   75.0

In [ ]:
201721207 소프트웨어전공 이승현 4/6 (화) 11:32